'''

Задание 2
 Найти периметр прямоугольника

Запросите у пользователя значение сторон a и b прямоугольника и вычислите его периметр.

Пример:

-Введите значение для стороны a:
>>2
-Введите значение для стороны b:
>>3
-Периметр прямоугольника ab равен 10


'''
a = int(input())
b = int(input())

p =(a+b)*2
print(p)
